Revit 2027 API
BuiltInFailures.ElevationFailures Class
 Failures about Elevation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ElevationFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ElevationFailures
Public NotInheritable Class ElevationFailures
public ref class ElevationFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElevationFailures = class end
The BuiltInFailures.ElevationFailures type exposes the following members.
Properties
Name | Description
ElevationDetach |  An Elevation arrow can't keep its Crop Region extents attached.
IncompatibleElevationTagFamily |  Attempt to change elevation tag families to one with incompatible view directions.
WarnElevSheet |  An elevation symbol references views on more than one sheet. It will show a blank sheet reference. To show the correct references, use a separate elevation symbol for the views on each sheet.
Top
See Also
Reference
Autodesk.Revit.DB Namespace